//一个口袋中放有12个球，已知其中3个是红的，3个是白的，6个是黑的，现从中任取8个，问共有多少种可能的颜色搭配？

#include<stdio.h>
int main()
{
    int m, n, number=0;
    printf("      红球  白球  黑球\n");
    printf("......................\n");
    for( m=0; m<=3; m++ )
        for( n=0; n<=3; n++ )
            if(8-m-n<=6)
                printf(" %2d:    %d    %d    %d\n", ++number, m, n, 8-m-n);
   
    return 0;
}

//运行结果：
/*
      红球  白球  黑球
......................
 1:    0    2    6
 2:    0    3    5
 3:    1    1    6
 4:    1    2    5
 5:    1    3    4
 6:    2    0    6
 7:    2    1    5
 8:    2    2    4
 9:    2    3    3
10:    3    0    5
11:    3    1    4
12:    3    2    3
13:    3    3    2
*/
