//输出 2 的 N 次幂：1, 2, 4, 8, .. 一直到 2^N。

#include <stdio.h>
#define N 16

int main(void) {
    int n;  // 记录当前指数
    int val = 1;  // 保存 2^n 的结果

    printf("\t  n  \t    2^n\n");
    printf("\t================\n");
    for (n=0; n<=N; n++) {
        printf("\t%3d \t %6d\n", n, val);
        val = 2*val;
    }
    return 0;
}


//输出结果：
//   n       2^n
//================
//   0        1
//   1        2
//   2        4
//   3        8
//   4       16
//   5       32
//   6       64
//   7      128
//   8      256
//   9      512
//  10     1024
//  11     2048
//  12     4096
//  13     8192
//  14    16384
//  15    32768
//  16    65536
