//马克思手稿中有一道趣味数学问题：有30个人，其中有男人、女人和小孩，他们在同一家饭馆吃饭，总共花了50先令。
//已知每个男人吃饭需要花3先令，每个女人吃饭需要花2先令，每个小孩吃饭需要花1先令，请编程求出男人、女人和小孩各有几人。

#include<stdio.h>
int main()
{
    int x, y, z, number=0;
    printf("    Men Women Children\n");
    for( x=0; x<=10; x++ )
    {
        y = 20 - 2 * x;
        z = 30 - x - y;
        if(3*x+2*y+z == 50)
            printf("%2d:%4d%5d%6d\n", ++number, x, y, z);
    }
    return 0;
}


//运行结果：
//    Men Women Children
// 1:   0   20    10
// 2:   1   18    11
// 3:   2   16    12
// 4:   3   14    13
// 5:   4   12    14
// 6:   5   10    15
// 7:   6    8    16
// 8:   7    6    17
// 9:   8    4    18
//10:   9    2    19
//11:  10    0    20
